mediarixo/Discovery-Projects/00-STM32_LIBRARIES/tm_stm32_ethernet.h
/**
 * @author  Tilen Majerle
 * @email   tilen@majerle.eu
 * @website http://stm32f4-discovery.com
 * @link    http://stm32f4-discovery.com/2015/02/library-52-ethernet-peripheral-on-stm32f4xx/
 * @version v1.1
 * @ide     Keil uVision
 * @license GNU GPL v3
 * @brief   ETHERNET library for STM32F4xx devices with built-in Ethernet controller
 *          and external PHY with RMII connnection (tested with DP83848)
 *	
@verbatim
   ----------------------------------------------------------------------
    Copyright (C) Tilen Majerle, 2015
    
    This program is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    any later version.
     
    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.
    
    You should have received a copy of the GNU General Public License
    along with this program.  If not, see <http://www.gnu.org/licenses/>.
   ----------------------------------------------------------------------
@endverbatim
 */
#ifndef TM_ETHERNET_H
#define TM_ETHERNET_H 110

/* C++ detection */
#ifdef __cplusplus
extern "C" {
#endif
/**
 * @addtogroup TM_STM32F4xx_Libraries
 * @{
 */

/**
 * @defgroup TM_ETHERNET
 * @brief    Ethernet library for STM32F4xx devices with built in ETH MAC - http://stm32f4-discovery.com/2015/02/library-52-ethernet-peripheral-on-stm32f4xx/
 * @{
 *
 * \par Pinout
 *
 * Library supports 2 modes of connecting and use:
 *  - MII: Media Independent Interface
 *  - RMII: Reduced Media Independent Interface
 *
 * \par MII Connection
 *
 * MII connection uses a lot of pins, but has slower (25MHz) reference clock.
 *
 * It uses 4 data bytes and with 25MHz clock, you get 100Mbit connection.
 *
 * To enable MII connection mode, open defines.h file and add define like below:
 *
@verbatim
//Enable MII connection mode
#define ETHERNET_MII_MODE
@endverbatim
 *
 *
@verbatim
ETH PHY     |STM32F4xx with ethernet

MDIO        |PA2
MDC         |PC1
REF_CLK     |PA1
CRS         |PH2
COL         |PH3
PPS_OUT     |PB5
RXD0        |PC4
RXD1        |PC5
RXD2        |PH6
RXD3        |PH7
RX_ERR      |PI10
RX_DV       |PA7
RX_CLK      |PC3
TX_EN       |PG11
TXD0        |PG13
TXD1        |PG14
TXD2        |PC2
TXD3        |PB8
@endverbatim
 *
 * \par RMII Connection
 *
 * RMII connection uses a small number of pins, but has greater (50MHz) reference clock.
 *
 * It uses 2 data bytes and with 50MHz clock, you get 100Mbit connection.
 *
 * RMII mode is supported using 2 pinspacks. By default, PP1 (PinsPack 1) is used. If you want to use PP2, then you need define in defines.h file:
 *
@verbatim
//Enable PinsPack 2 for RMII ethernet:
#define ETHERNET_RMII_PINSPACK_2
@endverbatim
 *
@verbatim
ETH PHY     |STM32F4xx with ethernet
            |PP1    |PP2
		
MDIO        |PA2    |PA2
MDC         |PC1    |PC1
REF_CLK     |PA1    |PA1
CRS         |PA7    |PA7
RXD0        |PC4    |PC4
RXD1        |PC5    |PC5
TX_EN       |PB11   |PG11
TXD0        |PB12   |PG13
TXD1        |PB13   |PG14
@endverbatim
 *
 * Also, PA8 pins HAVE TO be initialized as MCO alternate function, or communication will not work. Who knows why.
 *
 * PA8 pin is also MCO output, which has ability to output different clocks.
 *
 * I've added feature to output HSE crystal on this MCO pin. It can be used for 25MHz output if you have HSE 25MHz crystal and MII connection.
 *
 * Then you don't need separate crystal for PHY device.
 *
 * To enable MCO output HSE crystal value, open defines.h file and add define:
 *
@verbatim
//Enable MCO output with HSE clock
#define ETHERNET_MCO_CLOCK
@endverbatim
 *
 * \par DHCP
 *
 * Library supports DHCP to get IP from router.
 * This feature is disabled by default
 * To enable it, you need to add define in defines.h file:
 *
@verbatim
//Enable DHCP 
#define ETHERNET_USE_DHCP
@endverbatim
 *
 *\par Supported PHY devices
 *
 * This library supports more than just DP83848 PHY. Currently, supported list is below.
 * The number which is near text means value you have to set @ref ETHERNET_PHY define in case you want to select custom PHY.
 *
 *	- 0: DP83848
 *	- 1: LAN8720A
 *	- 2: KSZ8081RNA
 *
 * If you want (for example) to use KSZ8081RNA PHY, you need to do this (defines.h):
 *
@verbatim
//Use KSZ8081RNA PHY
#define ETHERNET_PHY   2
@endverbatim
 *
 * \par Changelog
 *
@verbatim
 Version 1.1
  - March 18, 2015
  - Added support for MII connection
  - Tested on STM324x9-Eval board

 Version 1.0
  - First release
@endverbatim
 *
 * \par Dependencies
 *
@verbatim
 - STM32F4xx
 - STM32F4xx RCC
 - STM32F4xx GPIO
 - STM32F4xx ETH
 - defines.h
 - attributes.h
 - LwIP stack
 - TM DELAY
 - TM GPIO
@endverbatim
 */

#include "stm32f7xx.h"
//#include "stm32f4xx_rcc.h" 
#include "tm_stm32_rcc.h"

//#include "stm32f4xx_gpio.h"
#include "tm_stm32_gpio.h"

#include "defines.h"
#include "attributes.h"
#include "tm_stm32_delay.h"
#include "tm_stm32_gpio.h"

///* Ethernet based includes */
//#include "stm32f4x7_eth.h"
//#include "stm32f4x7_eth_bsp.h"
//#include "netconf.h"
//#include "tcp_echoclient.h"
//#include "lwip/ip_addr.h"
//#include "lwip/dns.h"
//#include "lwip/tcp.h"

/* C based includes */
#include "string.h"
#include "stdio.h"

/**
 * @defgroup TM_ETHERNET_Macros
 * @brief    Library defines
 * @{
 */

/**
 * @brief  Ethernet PHY chip you will use for low level communication
 * @note   Default is DP83848 PHY
 */
#ifndef ETHERNET_PHY
#define ETHERNET_PHY						0
#endif

/**
 * @brief  Number of milliseconds when to check for link status from PHY
 */
#ifndef LINK_TIMER_INTERVAL
#define LINK_TIMER_INTERVAL					1000
#endif

/**
 * @brief  Default server PORT used for server 
 */
#ifndef ETHERNET_SERVER_PORT
#define ETHERNET_SERVER_PORT				80
#endif

///* Include server based options */
//#include "httpd.h"
//#include "fs.h"

/* MAC ADDRESS: MAC_ADDR0:MAC_ADDR1:MAC_ADDR2:MAC_ADDR3:MAC_ADDR4:MAC_ADDR5 */
/* In case you want to use custom MAC, use parameter in init function */
/**
 * @brief  Default MAC address for your device
 * @note   This MAC is used in case you set mac_addr param in @ref TM_ETHERNET_Init() function to "NULL"
 */
#ifndef MAC_ADDR0
#define MAC_ADDR0							0x06
#define MAC_ADDR1							0x05
#define MAC_ADDR2							0x04
#define MAC_ADDR3							0x03
#define MAC_ADDR4							0x02
#define MAC_ADDR5							0x01
#endif

/* Static IP ADDRESS: IP_ADDR0.IP_ADDR1.IP_ADDR2.IP_ADDR3 */
/* Used in case DHCP is not used or response failed */
/* In case you want to use custom IP, use parameter in init function */
/**
 * @brief  Default IP address
 * @note   Used in case DHCP is not used or response failed 
 * @note   In case you want to use custom IP, use parameter in @ref TM_ETHERNET_Init() function
 */
#ifndef IP_ADDR0
#define IP_ADDR0							192
#define IP_ADDR1							168
#define IP_ADDR2							0
#define IP_ADDR3							120
#endif

/**
 * @brief  Netmask address
 * @note   In case you want to use custom netmask, use parameter in @ref TM_ETHERNET_Init() function
 */
#ifndef NETMASK_ADDR0
#define NETMASK_ADDR0						255
#define NETMASK_ADDR1						255
#define NETMASK_ADDR2						255
#define NETMASK_ADDR3						0
#endif

/**
 * @brief  Gateway address
 * @note   In case you want to use custom gateway, use parameter in @ref TM_ETHERNET_Init() function
 */
#ifndef GW_ADDR0
#define GW_ADDR0							192
#define GW_ADDR1							168
#define GW_ADDR2							0
#define GW_ADDR3							1
#endif

/**
 * @brief  Default device name to be shown to your router when requesting IP address with DHCP 
 */
#ifndef ETHERNET_HOSTNAME_DHCP
#define ETHERNET_HOSTNAME_DHCP				"TM-ETH-Device"
#endif

/* RMII mode by default */
#if !defined(ETHERNET_MII_MODE) && !defined(ETHERNET_RMII_MODE)
	#define ETHERNET_RMII_MODE
#endif

