mediarixo/Discovery-Projects/00-STM32_LIBRARIES/tm_stm32_ethernet.h
/**
 * @brief  DNS Found callback
 *
 *         This function will be called when DNS server has valid IP address for your domain request.
 *
 *         It can be useful to make first connection in this function when you know your IP address where you must connect to.
 * @param  *host_name:
 * @param  ip_addr1: IP address 1st byte, MSB
 * @param  ip_addr2: IP address 2nd byte
 * @param  ip_addr3: IP address 3rd byte
 * @param  ip_addr4: IP address 4th byte, LSB
 * @retval None
 * @note   With __weak parameter to prevent link errors if not defined by user
 */
void TM_ETHERNETDNS_FoundCallback(char* host_name, uint8_t ip_addr1, uint8_t ip_addr2, uint8_t ip_addr3, uint8_t ip_addr4);

/**
 * @brief  DNS error callback
 *
 *         This function will be called when DNS error occured.
 * \par Possible errors
 *
 * 	- Requested domain does not exists,
 * 	- You have bad parameters in DNS function call
 *
 * @param  *host_name: Host name where an error occured
 * @retval None
 * @note   With __weak parameter to prevent link errors if not defined by user
 */
void TM_ETHERNETDNS_ErrorCallback(char* host_name);

/**
 * @brief  SSI callback for ethernet server
 *
 *         This function is called, when ethernet server wants to serve tag you pass in TM_ETHERNETSERVER_SetSSITags() function.
 * @param  iIndex: Tag index number. They are specified in order you pass to TM_ETHERNETSERVER_SetSSITags function
 * @param  *pcInsert: Pointer where you should set your content that will be displayed where your tag is specified in files
 * @param  iInsertLen: Max string length
 * @retval None
 * @note   With __weak parameter to prevent link errors if not defined by user
 */
uint16_t TM_ETHERNETSERVER_SSICallback(int iIndex, char *pcInsert, int iInsertLen);

/**
 * @brief  Client connected callback
 *         Called when new client is connected to server
 *
 *         This function can be used, to block IP address.
 *
 *         IP address, from where user access to your server is stored in *pcb variable:
@verbatim
remote_ip = pcb->remote_ip.addr;
@endverbatim
 *
 * @note   You can check here for your blocked IP addresses
 * @param  *pcb: Pointer to active LwIP PCB structure
 * @retval Connection status:
 *            - 0: You don't allow connection to server
 *            - 1: COnnection to server is allowed
 * @note   With __weak parameter to prevent link errors if not defined by user
 */
uint8_t TM_ETHERNETSERVER_ClientConnectedCallback(struct tcp_pcb *pcb);

/**
 * @brief  Client disconnected from server
 *
 *         Called when new client is diconnected from server (Or connection closed)
 * @retval None
 * @note   With __weak parameter to prevent link errors if not defined by user
 */
void TM_ETHERNETSERVER_ClientDisconnectedCallback(void);

/**
 * @brief  Open file callback
 *
 *         Called when user based file should be open when new client is connected
 *         If you want to use server on your SDcard or USB flash or whatever,
 *         here you can open file and do the stuff.
 *
 * @note   You must set file->len parameter to your file size number!
 *
 * @note   If You don't open file (return 0) then default file in flash will be used,
 *         that will say "Hello world from default server file", stored in fsdata.c.
 *
 * @note   Only one file at a time will be opened, so if you need to mount card,
 *         you can mount it in this function also.
 * @param  *file: Pointer to @ref fs_file structure
 * @param  *name: File name that should be opened
 * @retval 0 in case you can't/don't want to open file, or 1 if file is successfully opened and prepared for reading
 * @note   With __weak parameter to prevent link errors if not defined by user
 */
//int TM_ETHERNETSERVER_OpenFileCallback(struct fs_file* file, const char *name);

/**
 * @brief  Close file callback
 *
 *         Called when reading file is finished and file can be closed.
 *
 * @note   If you need to unmount your SD card, you can do it here.
 * @param  *file: Pointer to @ref fs_file struct
 * @retval None
 * @note   With __weak parameter to prevent link errors if not defined by user
 */
//void TM_ETHERNETSERVER_CloseFileCallback(struct fs_file* file);

/**
 * @brief  Read file callback
 *
 *         Called when file should be read.
 *
 * @note   This function may be called more than just one time, depends on file length.
 * @param  *file: Pointer to @ref fs_file struct
 * @param  *buffer: Pointer to buffer, where you should save your data
 * @param  count: Number of bytes that should be read. You can read less than this number. This is max number you can read this time
 * @retval Number of read bytes or -1 in case we are at the end of file.
 * @note   With __weak parameter to prevent link errors if not defined by user
 */
//int TM_ETHERNETSERVER_ReadFileCallback(struct fs_file* file, char* buffer, int count);

/**
 * @brief  Post request begin callback
 *
 *         This function is called, when POST request is trying to be started to our server.
 *
 *         With this function, you can accept/decline POST request, depending on parameters you receive
 *
 * @note   After POST request finish, you have to choose one file, which will be used to displayed to user after successfull POST end.
 *
 * @note   If you don't set it by yourself, then "/index.html" file will be used. You can do that to set your custom file:
@verbatim
strcpy(params->response_uri, "/yourfile.html");
@endverbatim
 *
 * @note   In this structure are also other variables, which one, you should look at @ref TM_ETHERNETPOST_t struct declaration.
 * @param  *params: Pointer to @ref TM_ETHERNETPOST_t structure which contains everything about POST connection.
 * @retval Accept or deny POST request
 *            - 0: Deny POST request
 *            - > 0: Allow POST request
 * @note   With __weak parameter to prevent link errors if not defined by user
 */
uint8_t TM_ETHERNETSERVER_PostRequestBeginCallback(TM_ETHERNETPOST_t* params);

/**
 * @brief  Post request receive data available callback
 *
 *         This function is called, when we have "Content-Length" statement.
 *
 * @note   Function might be called multiple times, depends on how many data you try to sent over POST method.
 *
 * @note   Data are stored inside p->payload variable pointer, which is void pointer. Make a cast to char* variable.
 *
 * @note   In pbuf struct is also length of this packet, so you have a little control about that.
 *
 * @note   To know when you have last time called this function, you can make a compare of params variables.
 * @param  *params: Pointer to @ref TM_ETHERNETPOST_t structure which contains everything about POST connection.
 * @param  *p: Pointer to pbuf structure where data are stored.
 * @retval Receive more data
 *            - 0: STOP receiving POST data
 *            - > 0: Continue with receiveing more POST data from current connection
 * @note   With __weak parameter to prevent link errors if not defined by user
 */
uint8_t TM_ETHERNETSERVER_PostRequestReceiveDataCallback(TM_ETHERNETPOST_t* params, struct pbuf* p);

/**
 * @brief  Post request end callback
 *
 *         This function is called when POST request is done.
 *
 *         This function must set response_uri variable to set response URL, which will be used to show to user.
 *         If you don't set it, then default will be used.
 * @param  *connection: Pointer to connection parameters, it's type is struct http_state *
 * @param  *response_uri: Pointer to buffer for response uri set
 * @param  response_uri_len: Length of response uri buffer length
 * @retval None
 * @note   With __weak parameter to prevent link errors if not defined by user
 */
//void TM_ETHERNETSERVER_PostRequestEndCallback(void* connection, char* response_uri, u16_t response_uri_len);

/**
 * @brief  PHY low layer custom options callback
 *
 *         Called when ethernet peripheral is ready.
 *         In this function, user can do other stuff, depending on PHY which is used in project.
 *
 * \par Example
 *
 *	- Set LED mode for DP83848 PHY, or something else
 *
 * @param  PHYAddress: PHY address when using ETH_ReadPHYRegister and ETH_WritePHYRegister functions
 * @retval None
 * @note   With __weak parameter to prevent link errors if not defined by user
 */
void TM_ETHERNETPHY_CustomOptions(uint32_t PHYAddress);

/**
 * @brief  Called on ethernet GPIO initialization
 *         In this function, user can initialize custom pins, which will be used for communication with PHY.
 * @note   Don't implement this function in case you want default pinout
 * @note   With __weak parameter to prevent link errors if not defined by user
 * @retval User status:
 *            - 0: We want default pinout from library
 *            - > 0: We made custom pinout
 * @note   With __weak parameter to prevent link errors if not defined by user
 */
uint8_t TM_ETHERNET_InitPinsCallback(void);

/**
 * @}
 */
 
/**
 * @}
 */
 
/**
 * @}
 */
 
/**
 * @}
 */

/* Private functions which should not be called from user */
void TM_ETHERNET_INT_CustomOptions(uint32_t PHYAddress);
void TM_ETHERNET_INT_SetIPAddress(uint8_t ip_addr1, uint8_t ip_addr2, uint8_t ip_addr3, uint8_t ip_addr4, uint8_t dhcp);
void TM_ETHERNET_INT_LinkIsDownCallback(void);
void TM_ETHERNET_INT_LinkIsUpCallback(void);

/* C++ detection */
#ifdef __cplusplus
}
#endif

#endif

